### Planned Changes to Server Infrastructure
#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Plan 📖 `success`
#### Terraform Validation 🤖 `success`

<details><summary>Show Plan</summary>

```terraform
random_string.resource_code: Refreshing state... [id=17vie6z9]
module.server.random_password.password: Refreshing state... [id=none]
module.server.random_password.session_secret_value: Refreshing state... [id=none]
github_repository_environment.this: Refreshing state... [id=indok-api:production]
module.server.module.resource_group.azurerm_resource_group.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-17vie6z9]
module.server.data.azurerm_key_vault_secret.postmark_api_token: Reading...
module.server.data.azurerm_client_config.current: Reading...
module.server.data.azurerm_key_vault_secret.feide_client_secret: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00MmJiMGZiYS0wZmIyLTRjZWItYmRiZi1jNmNjNmFmZTI1MDY7b2JqZWN0SWQ9Y2IxNTc2YmItMjYxOC00NWEwLTgzNjMtMDU3NWQ3ZTdlNDEyO3N1YnNjcmlwdGlvbklkPTBmNmI1YzhlLWNjMTUtNGFmNC1iYTYwLTQwYWE4MzAxOTU1ZTt0ZW5hbnRJZD1mMTdhY2Y1Ni1hYjEzLTQzZmEtYjlkNy1mMGUwZDYyODMyNmM=]
module.server.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD00MmJiMGZiYS0wZmIyLTRjZWItYmRiZi1jNmNjNmFmZTI1MDY7b2JqZWN0SWQ9Y2IxNTc2YmItMjYxOC00NWEwLTgzNjMtMDU3NWQ3ZTdlNDEyO3N1YnNjcmlwdGlvbklkPTBmNmI1YzhlLWNjMTUtNGFmNC1iYTYwLTQwYWE4MzAxOTU1ZTt0ZW5hbnRJZD1mMTdhY2Y1Ni1hYjEzLTQzZmEtYjlkNy1mMGUwZDYyODMyNmM=]
module.server.module.managed_identity.azurerm_user_assigned_identity.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-17vie6z9/providers/Microsoft.ManagedIdentity/userAssignedIdentities/managed-identity-17vie6z9]
module.server.module.vnet.azurerm_virtual_network.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-17vie6z9/providers/Microsoft.Network/virtualNetworks/vnet-17vie6z9]
module.server.module.redis.azurerm_private_dns_zone.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-17vie6z9/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net]
module.server.module.database.azurerm_private_dns_zone.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-17vie6z9/providers/Microsoft.Network/privateDnsZones/production-17vie6z9.postgres.database.azure.com]
module.server.module.container_app_environment.azurerm_log_analytics_workspace.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-17vie6z9/providers/Microsoft.OperationalInsights/workspaces/ca-log-workspace-17vie6z9]
module.server.module.redis.azurerm_redis_cache.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-17vie6z9/providers/Microsoft.Cache/redis/redis17vie6z9]
module.server.module.container_app_environment.azurerm_subnet.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-17vie6z9/providers/Microsoft.Network/virtualNetworks/vnet-17vie6z9/subnets/ca-subnet-17vie6z9]
module.server.module.redis.azurerm_subnet.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-17vie6z9/providers/Microsoft.Network/virtualNetworks/vnet-17vie6z9/subnets/redis-subnet-17vie6z9]
module.server.module.database.azurerm_subnet.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-17vie6z9/providers/Microsoft.Network/virtualNetworks/vnet-17vie6z9/subnets/pg-subnet-17vie6z9]
module.server.azurerm_role_assignment.rg_reader: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-17vie6z9/providers/Microsoft.Authorization/roleAssignments/ffd3067e-c51c-36a5-148d-264169a1b64a]
module.server.azurerm_role_assignment.key_vault_user: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-17vie6z9/providers/Microsoft.Authorization/roleAssignments/5b3f9563-71e1-22a7-54c6-16a2455f3181]
module.server.module.key_vault.azurerm_key_vault.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-17vie6z9/providers/Microsoft.KeyVault/vaults/key-vault-17vie6z9]
module.server.module.redis.azurerm_private_dns_zone_virtual_network_link.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-17vie6z9/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net/virtualNetworkLinks/vnet-private-zone-link]
module.server.module.database.azurerm_private_dns_zone_virtual_network_link.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-17vie6z9/providers/Microsoft.Network/privateDnsZones/production-17vie6z9.postgres.database.azure.com/virtualNetworkLinks/pg-17vie6z9.com]
module.server.module.container_app_environment.azurerm_container_app_environment.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-17vie6z9/providers/Microsoft.App/managedEnvironments/ca-env-17vie6z9]
module.server.module.database.azurerm_postgresql_flexible_server.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-17vie6z9/providers/Microsoft.DBforPostgreSQL/flexibleServers/pg-fs-17vie6z9]
module.server.data.azurerm_key_vault_secret.feide_client_secret: Read complete after 2s [id=https://shared-key-vault-altht.vault.azure.net/secrets/feide-client-secret/299f08ebe57941dda63f30a792037af0]
module.server.data.azurerm_key_vault_secret.postmark_api_token: Read complete after 2s [id=https://shared-key-vault-altht.vault.azure.net/secrets/postmark-api-token/e97d2c8704e7419398752b33ece7c9fe]
module.server.module.database.azurerm_postgresql_flexible_server_database.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-17vie6z9/providers/Microsoft.DBforPostgreSQL/flexibleServers/pg-fs-17vie6z9/databases/pg-fs-db-17vie6z9]
module.server.module.redis.azurerm_private_endpoint.this: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-17vie6z9/providers/Microsoft.Network/privateEndpoints/endpoint-17vie6z9]
module.server.azurerm_key_vault_secret.redis_connection_string: Refreshing state... [id=https://key-vault-17vie6z9.vault.azure.net/secrets/redis-connection-string/c2ef74eee5b3493db972dbe121351c6c]
module.server.azurerm_key_vault_secret.db_connection_string: Refreshing state... [id=https://key-vault-17vie6z9.vault.azure.net/secrets/db-connection-string/f02e58dda1fa457cb80eb4613f26d58e]
module.server.azurerm_key_vault_secret.session_secret: Refreshing state... [id=https://key-vault-17vie6z9.vault.azure.net/secrets/session-secret/10bd66a83c4345d8bc15251805cbf6a8]
module.server.azurerm_container_app.server: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-17vie6z9/providers/Microsoft.App/containerApps/server-17vie6z9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.server.azurerm_container_app.server will be updated in-place
  ~ resource "azurerm_container_app" "server" {
        id                            = "/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-17vie6z9/providers/Microsoft.App/containerApps/server-17vie6z9"
        name                          = "server-17vie6z9"
        tags                          = {
            "environment" = "production"
            "workspace"   = "default"
        }
        # (8 unchanged attributes hidden)

      ~ template {
            # (2 unchanged attributes hidden)

          ~ container {
              ~ image             = "ghcr.io/rubberdok/server:be8afda9c688b4a55127547e142a8eef2c98c54d" -> "ghcr.io/rubberdok/server:latest"
                name              = "server"
                # (5 unchanged attributes hidden)

              ~ env {
                    name  = "SENTRY_RELEASE"
                  ~ value = "be8afda9c688b4a55127547e142a8eef2c98c54d" -> "48a85b4542566390882a1def6d1bf7dbe8dc1c5a"
                }
              + env {
                  + name  = "SERVE_HTTP"
                  + value = "true"
                }
              + env {
                  + name  = "WORKER"
                  + value = "false"
                }

                # (23 unchanged blocks hidden)
            }

          ~ init_container {
              ~ image             = "ghcr.io/rubberdok/server:be8afda9c688b4a55127547e142a8eef2c98c54d" -> "ghcr.io/rubberdok/server:latest"
                name              = "migrate"
                # (5 unchanged attributes hidden)

              ~ env {
                    name  = "SENTRY_RELEASE"
                  ~ value = "be8afda9c688b4a55127547e142a8eef2c98c54d" -> "48a85b4542566390882a1def6d1bf7dbe8dc1c5a"
                }

                # (21 unchanged blocks hidden)
            }
        }

        # (8 unchanged blocks hidden)
    }

  # module.server.azurerm_container_app.worker will be created
  + resource "azurerm_container_app" "worker" {
      + container_app_environment_id  = "/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/rg-17vie6z9/providers/Microsoft.App/managedEnvironments/ca-env-17vie6z9"
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "worker-17vie6z9"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-17vie6z9"
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "production"
          + "workspace"   = "default"
        }

      + registry {
          + password_secret_name = "docker-registry-password"
          + server               = "ghcr.io"
          + username             = "USERNAME"
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 1
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "ghcr.io/rubberdok/server:latest"
              + memory            = "0.5Gi"
              + name              = "worker"

              + env {
                  + name  = "CORS_ORIGINS"
                  + value = "https://indokntnu.no"
                }
              + env {
                  + name  = "CORS_CREDENTIALS"
                  + value = "true"
                }
              + env {
                  + name  = "NODE_ENV"
                  + value = "production"
                }
              + env {
                  + name  = "NO_REPLY_EMAIL"
                  + value = "no-reply@indokntnu.no"
                }
              + env {
                  + name  = "PORT"
                  + value = "4000"
                }
              + env {
                  + name  = "SERVER_URL"
                  + value = "https://server-17vie6z9.blacksea-cdec4a8e.norwayeast.azurecontainerapps.io"
                }
              + env {
                  + name  = "FEIDE_CLIENT_ID"
                  + value = "fcaa9e30-a6d3-4809-8fea-cdd7b3de1c98"
                }
              + env {
                  + name  = "FEIDE_BASE_URL"
                  + value = "https://auth.dataporten.no"
                }
              + env {
                  + name  = "SESSION_COOKIE_NAME"
                  + value = "sessionid"
                }
              + env {
                  + name  = "SESSION_COOKIE_DOMAIN"
                  + value = "server-17vie6z9.blacksea-cdec4a8e.norwayeast.azurecontainerapps.io"
                }
              + env {
                  + name  = "SESSION_COOKIE_HTTP_ONLY"
                  + value = "true"
                }
              + env {
                  + name  = "SESSION_COOKIE_SECURE"
                  + value = "true"
                }
              + env {
                  + name  = "SENTRY_DSN"
                  + value = "https://3e8801d618184101b5d2c6b7b4da6f0b@o514678.ingest.sentry.io/6553834"
                }
              + env {
                  + name  = "RATE_LIMIT_MAX"
                  + value = "1000"
                }
              + env {
                  + name  = "REDIRECT_ORIGINS"
                  + value = "https://server-17vie6z9.blacksea-cdec4a8e.norwayeast.azurecontainerapps.io,https://indokntnu.no,https://indøkntnu.no"
                }
              + env {
                  + name  = "FEIDE_GROUPS_API"
                  + value = "https://groups-api.dataporten.no/groups/me/groups"
                }
              + env {
                  + name  = "SENTRY_RELEASE"
                  + value = "48a85b4542566390882a1def6d1bf7dbe8dc1c5a"
                }
              + env {
                  + name        = "REDIS_CONNECTION_STRING"
                  + secret_name = "redis-connection-string"
                }
              + env {
                  + name        = "DATABASE_CONNECTION_STRING"
                  + secret_name = "database-connection-string"
                }
              + env {
                  + name        = "FEIDE_CLIENT_SECRET"
                  + secret_name = "feide-client-secret"
                }
              + env {
                  + name        = "SESSION_SECRET"
                  + secret_name = "session-secret"
                }
              + env {
                  + name        = "POSTMARK_API_TOKEN"
                  + secret_name = "postmark-api-token"
                }
              + env {
                  + name  = "WORKER"
                  + value = "true"
                }
              + env {
                  + name  = "SERVE_HTTP"
                  + value = "false"
                }
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @larwaa, Action: `pull_request`*